In [1]:
import pandas as pd
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

username = 'root'
password = 'password' #insert your PWORD here

In [2]:
#import tattoo csv
csv_file = "nba-tattoos-data.csv"
tattoos_df = pd.read_csv(csv_file)
tattoos_df.head()

    Player Name Tattoos yes/no
0    A.J. Price             no
1    Aaron Gray             no
2    Al Horford             no
3  Al Jefferson             no
4   Al Thornton             no

In [3]:
#rename columns to more program friendly style
tattoos_df = tattoos_df.rename(index=str, columns={"Player Name": "playerName", "Tattoos yes/no": "tattooed"})
tattoos_df.head()

     playerName tattooed
0    A.J. Price       no
1    Aaron Gray       no
2    Al Horford       no
3  Al Jefferson       no
4   Al Thornton       no

In [4]:
#import stats csv
csv_file = "nba-stats-data.csv"
stats_df = pd.read_csv(csv_file)
stats_df.head()

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,1,Alex Abrines\abrinal01,SG,24,OKC,75,8,1134,115,291,...,0.848,26,88,114,28,38,8,25,124,353
1,2,Quincy Acy\acyqu01,PF,27,BRK,70,8,1359,130,365,...,0.817,40,217,257,57,33,29,60,149,411
2,3,Steven Adams\adamsst01,C,24,OKC,76,76,2487,448,712,...,0.559,384,301,685,88,92,78,128,215,1056
3,4,Bam Adebayo\adebaba01,C,20,MIA,69,19,1368,174,340,...,0.721,118,263,381,101,32,41,66,138,477
4,5,Arron Afflalo\afflaar01,SG,32,ORL,53,3,682,65,162,...,0.846,4,62,66,30,4,9,21,56,179

In [5]:
#show all column names for easier viewing
list(stats_df.columns.values)

['Rk',
 'Player',
 'Pos',
 'Age',
 'Tm',
 'G',
 'GS',
 'MP',
 'FG',
 'FGA',
 'FG%',
 '3P',
 '3PA',
 '3P%',
 '2P',
 '2PA',
 '2P%',
 'eFG%',
 'FT',
 'FTA',
 'FT%',
 'ORB',
 'DRB',
 'TRB',
 'AST',
 'STL',
 'BLK',
 'TOV',
 'PF',
 'PTS']

In [6]:
#remove slash from each player name to match tattoos datasource
stats_df["name"] = stats_df["Player"].apply(lambda x: x.split("\\")[0])
#create new df with needed statistics
final_stats_df = stats_df[['name', 'PTS', 'TRB', 'AST', 'STL', 'BLK', '3P', 'Pos', 'G']].copy()

In [7]:
#connect to db fill in variables above to connect to local my sql
conn_string = f"mysql://{username}:{password}@localhost:3306/nba_db"
engine = create_engine(conn_string)

In [8]:
#load dfs to sql
final_stats_df.to_sql(name='stats', con=engine, if_exists='replace', index=False)
tattoos_df.to_sql(name='tattoo', con=engine, if_exists='replace', index=False)

In [9]:
#confirm sql db has been written
pd.read_sql_query('select * from stats', con=engine).head()

            name   PTS  TRB  AST  STL  BLK   3P Pos   G
0   Alex Abrines   353  114   28   38    8   84  SG  75
1     Quincy Acy   411  257   57   33   29  102  PF  70
2   Steven Adams  1056  685   88   92   78    0   C  76
3    Bam Adebayo   477  381  101   32   41    0   C  69
4  Arron Afflalo   179   66   30    4    9   27  SG  53

In [10]:
#confirm sql db has been written
pd.read_sql_query('select * from tattoo', con=engine).head()

     playerName tattooed
0    A.J. Price       no
1    Aaron Gray       no
2    Al Horford       no
3  Al Jefferson       no
4   Al Thornton       no

In [11]:
#How many tattooed/Nontattooed players played a game in the NBA in the 2017/2018 Season
pd.read_sql_query('SELECT t.tattooed, count(t.playerName) as playerCount FROM tattoo t Left JOIN stats s ON t.playerName=s.name WHERE s.G IS NOT NULL GROUP BY t.tattooed;', con=engine).head()

  tattooed  playerCount
0       no          132
1      yes          155

In [12]:
#get total statistics and players for tattooed and nontattooed players, had to drop null games played from tattoo list since more players were listed than played in the season being analyzed
pd.read_sql_query('SELECT t.tattooed, sum(s.PTS) as points, sum(s.TRB) as rebounds, sum(s.AST) as assists, sum(s.STL) as steals, sum(s.BLK) as blocks, sum(s.3P) as 3pointersmade FROM tattoo t Left JOIN stats s ON t.playerName=s.name GROUP BY t.tattooed;', con=engine).head()

  tattooed   points  rebounds  assists  steals  blocks  3pointersmade
0       no  75125.0   30497.0  15944.0  4940.0  3524.0         6813.0
1      yes  85273.0   33581.0  18703.0  6309.0  3491.0         9317.0

In [13]:
#Are certain positions more tattooed than others? 
pd.read_sql_query('SELECT t.tattooed, s.Pos, COUNT(*) as n FROM tattoo t Left JOIN stats s ON t.playerName=s.name WHERE s.Pos IS NOT NULL GROUP BY s.Pos, t.tattooed;', con=engine).head(20)

   tattooed    Pos   n
0        no      C  36
1       yes      C  28
2        no     PF  31
3       yes     PF  24
4        no     PG  20
5       yes     PG  38
6       yes  PG-SG   1
7        no     SF  19
8       yes     SF  27
9       yes  SF-SG   2
10       no     SG  26
11      yes     SG  35